#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.vpc: Refreshing state... [id=vpc-043b7225c143ec9eb]
aws_internet_gateway.ig: Refreshing state... [id=igw-07c3a1f70e5dabb8c]
aws_route_table.public: Refreshing state... [id=rtb-0e2d8aa57068bb571]
aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-00e23b716a5fdfe70]
aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-09264a3b9e8f4de46]
aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0597c600e5696e171]
aws_route_table.private: Refreshing state... [id=rtb-027a82392b05a244b]
aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-0065bbeb5ce7676f1]
aws_eip.nat_eip: Refreshing state... [id=eipalloc-02df06f0971dabbca]
aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0e2d8aa57068bb5711080289494]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0fe5c17750eb94f67]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-084561808acab444d]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00ce79e02c14da04f]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01d872811c43ef53a]
aws_nat_gateway.nat: Refreshing state... [id=nat-0b73d623c2eea4568]
aws_route.private_internet_gateway: Refreshing state... [id=r-rtb-027a82392b05a244b1080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route.private_internet_gateway will be updated in-place
  ~ resource "aws_route" "private_internet_gateway" {
      + gateway_id             = "nat-0b73d623c2eea4568"
        id                     = "r-rtb-027a82392b05a244b1080289494"
      - nat_gateway_id         = "nat-0b73d623c2eea4568" -> null
        # (4 unchanged attributes hidden)
    }

  # aws_s3_bucket.example will be created
  + resource "aws_s3_bucket" "example" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "tf-flow-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @chamambom, Action: `pull_request`*